# Создайте собственный класс-исключение, обрабатывающий ситуацию деления на нуль.
# Проверьте его работу на данных, вводимых пользователем. При вводе пользователем нуля в качестве делителя
# программа должна корректно обработать эту ситуацию и не завершиться с ошибкой.

class ClassException(Exception):
    def __init__(self, txt):
        self.txt = txt
        print('Ошибка!')


num1, num2 = map(int, [input('Введите 1 число: '), input('Введите 2 число: ')])

try:
    if num2 == 0:
        raise ClassException('Деление на ноль!')
except ClassException as err:
    print(err, 'Делить на ноль нельзя!')
else:
    print(num1 / num2)